# Для игры стратегии необходимо создать абстрактный класс Unit.
# Каждый юнит должен уметь двигаться, защищаться и атаковать,
# поэтому Unit имеет три абстрактных метода: move(), attack() и defend().

# Два конкретных класса, Infantry (пехота) и Cavalry (кавалерия), будут наследовать и реализовывать эти методы.
#   метод move в классе Infantry должен печатать сообщение "Пехота передвигается в пешем порядке",
#   метод attack в классе Infantry должен печатать сообщение "Пехота участвует в ближнем бою",
#   метод defend в классе Infantry должен печатать сообщение "Пехота держит строй",
#   метод move в классе Cavalry должен печатать сообщение "Кавалерия передвигается верхом".
#   метод attack в классе Cavalry должен печатать сообщение "Кавалерия переходит в атаку".
#   метод defend в классе Cavalry должен печатать сообщение "Кавалерия защищает фланги".

# В игре также должен быть класс Squad, который будет добавлять юнит в армию и выполнять операции атаки и защиты.
#   метод add_unit в классе Squad должен добавлять солдата в армию.
#   метод attack в классе Squad должен вызывать метод move() и attack() для каждого юнита в армии.
#   метод defend в классе Squad должен вызывать метод move() и defend() для каждого юнита в армии.

# Чтобы гарантировать, что используются только экземпляры класса Unit,
# нужно создать декоратор validate_unit, который будет проверять тип объекта.

# Если объект не является экземпляром класса Unit, декоратор выдаст ошибку TypeError.
# Декоратор будет применяться к методам move(), attack() и defend() классов Infantry и Cavalry.




# пример работы

Squad = Squad()
Squad.add_unit(Infantry())
Squad.add_unit(Cavalry())
Squad.add_unit(Infantry())
Squad.add_unit(Cavalry())

Squad.attack()
Squad.defend()


# Пехота передвигается в пешем порядке
# Пехота участвует в ближнем бою
# Кавалерия передвигается верхом
# Кавалерия переходит в атаку
# Пехота передвигается в пешем порядке
# Пехота участвует в ближнем бою
# Кавалерия передвигается верхом
# Кавалерия переходит в атаку

# Пехота передвигается в пешем порядке
# Пехота держит строй
# Кавалерия передвигается верхом
# Кавалерия защищает фланги
# Пехота передвигается в пешем порядке
# Пехота держит строй
# Кавалерия передвигается верхом
# Кавалерия защищает фланги